#!/usr/bin/python 
# -*- coding:utf-8 -*- 
import re
import urllib
import urllib2
import sys
import os
import time
import json
import socket
# import string

print sys.getdefaultencoding()


def getHtml(keyword, start):
    req_header = {'User-Agent': 'Mozilla/5.0 (Windows; U; Windows NT 6.1; en-US; rv:1.9.1.6) Gecko/20091201 360SE'}
    url = 'http://image.baidu.com/search/acjson?tn=resultjson_com&ipn=rj&ct=201326592&is=&fp=result' \
          '&queryWord=' + keyword + '&cl=2&lm=-1&ie=utf-8&oe=utf-8&adpicid=&st=-1&z=&ic=0' \
                                    '&word=' + keyword + '&s=0&se=&tab=&width=&height=&face=1&istype=2&qc=&nc=&fr=%26fr%3D&pn=' + str(
        start) + '&rn=60&1433936881420='
    # url='http://cn.bing.com/images/async?q='+keyword+'&async=content&first='+str(start)+'&count=35&IID=images.1&IG=06fd0edefcfa4c9a8be876677b2cd340&CW=1693&CH=312&dgsrr=false&qft=+filterui:face-face&form=R5IR30'
    req = urllib2.Request(url, None, req_header)
    response = urllib2.urlopen(req)
    html = response.read()
    time.sleep(0.5)
    response.close()
    return html


def decoder(url_src):
    dict = {'w': 'a', 'k': 'b', 'v': 'c', '1': 'd', 'j': 'e',
            'u': 'f', '2': 'g', 'i': 'h', 't': 'i', '3': 'j',
            'h': 'k', 's': 'l', '4': 'm', 'g': 'n', '5': 'o',
            'r': 'p', 'q': 'q', '6': 'r', 'f': 's', 'p': 't',
            '7': 'u', 'e': 'v', 'o': 'w', '8': '1', 'd': '2',
            'n': '3', '9': '4', 'c': '5', 'm': '6', '0': '7',
            'b': '8', 'l': '9', 'a': '0'
            }

    url_src = url_src.replace('_z2C$q', ':')
    url_src = url_src.replace('_z&e3B', '.')
    url_src = url_src.replace('AzdH3F', '/')
    url_list = []
    for i in range(0, len(url_src)):
        key = url_src[i]
        if dict.has_key(key):
            t = dict[key]
        else:
            t = key
        url_list.append(t)
    url = ''.join(url_list)
    return url


def getImg(html, start, imgpath, Info):
    cot = start
    t1 = 'source: '
    t2 = ' dst '
    t3 = ' success'
    t4 = ' fail'
    t5 = ' exist'

    reg = r'objURL":"(.+?)",'
    imgre = re.compile(reg)
    imglist = imgre.findall(html)

    for url in imglist:
        imgurl = decoder(url)
        tt = imgurl.split('/')
        image_name = tt[-1]
        type = image_name.split('.')[-1]
        if type != 'jpg' and type != 'png' and type != 'JPG' and type != 'PNG':
            type = 'jpg'
            name = imgpath + '/' + image_name + '_' + str(cot) + '.' + type
        else:
            name = imgpath + '/' + image_name[0:len(image_name) - len(type) - 1] + '_' + str(cot) + '.' + type

        try:
            urllib.urlretrieve(imgurl, name)
            tag = 1
        except:
            tag = 0
            pass
        if (tag == 1):
            str_print = t1 + imgurl + t2 + name + t3
        else:
            str_print = t1 + imgurl + t2 + name + t4
        print str_print
        print >> Info, str_print
        cot += 1


socket.setdefaulttimeout(10)

keywords_list = [
    # '1个月宝宝', '2个月宝宝', '3个月宝宝', '4个月宝宝', '5个月宝宝', '6个月宝宝', '7个月宝宝', '8个月宝宝', '9个月宝宝', '10个月宝宝', '11个月宝宝', '12个月宝宝',
    # '1岁小孩', '2岁小孩', '3岁小孩', '4岁小孩', '5岁小孩', '6岁小孩', '7岁小孩', '8岁小孩', '9岁小孩', '10岁小孩',
    # '11岁', '12岁', '13岁', '14岁', '15岁', '16岁', '17岁', '18岁', '19岁', '20岁', '21岁', '22岁', '23岁', '24岁', '25岁', '26岁', '27岁', '28岁', '29岁', '30岁',
    # '31岁', '32岁', '33岁', '34岁', '35岁', '36岁', '37岁', '38岁', '39岁', '40岁', '41岁', '42岁', '43岁', '44岁', '45岁', '46岁', '47岁', '48岁', '49岁', '50岁',
    # '51岁', '52岁', '53岁', '54岁', '55岁', '56岁', '57岁', '58岁', '59岁', '60岁', '61岁', '62岁', '63岁', '64岁', '65岁', '66岁', '67岁', '68岁', '69岁', '70岁',
    # '71岁', '72岁', '73岁', '74岁', '75岁', '76岁', '77岁', '78岁', '79岁', '80岁', '81岁', '82岁', '83岁', '84岁', '85岁', '86岁', '87岁', '88岁', '89岁', '90岁',
    # '91岁', '92岁', '93岁', '94岁', '95岁', '96岁', '97岁', '98岁', '99岁', '100岁' '100多岁老人',

    # '1个月男孩', '2个月男孩', '3个月男孩', '4个月男孩', '5个月男孩', '6个月男孩', '7个月男孩', '8个月男孩', '9个月男孩', '10个月男孩', '11个月男孩', '12个月男孩',
    # '1岁男孩', '2岁男孩', '3岁男孩', '4岁男孩', '5岁男孩', '6岁男孩', '7岁男孩', '8岁男孩', '9岁男孩', '10岁男孩',
    # '11岁男孩', '12岁男孩', '13岁男孩', '14岁男孩', '15岁男孩', '16岁男孩', '17岁男孩', '18岁男孩', '19岁男孩', '20岁男人',
    # '21岁男人', '22岁男人', '23岁男人', '24岁男人', '25岁男人', '26岁男人', '27岁男人', '28岁男人', '29岁男人', '30岁男人',
    # '31岁男人', '32岁男人', '33岁男人', '34岁男人', '35岁男人', '36岁男人', '37岁男人', '38岁男人', '39岁男人', '40岁男人',
    # '41岁男人', '42岁男人', '43岁男人', '44岁男人', '45岁中年男人', '46岁中年男人', '47岁中年男人', '48岁中年男人', '49岁中年男人', '50岁中年男人',
    # '51岁中年男人', '52岁中年男人', '53岁中年男人', '54岁中年男人', '55岁中年男人', '56岁中年男人', '57岁中年男人', '58岁中年男人', '59岁中年男人', '60岁中年男人',
    # '61岁老头', '62岁老头', '63岁老头', '64岁老头', '65岁老头', '66岁老头', '67岁老头', '68岁老头', '69岁老头', '70岁老头',
    # '71岁老头', '72岁老头', '73岁老头', '74岁老头', '75岁老头', '76岁老头', '77岁老头', '78岁老头', '79岁老头', '80岁老头',
    # '81岁老头', '82岁老头', '83岁老头', '84岁老头', '85岁老头', '86岁老头', '87岁老头', '88岁老头', '89岁老头', '90岁老头',
    # '91岁老头', '92岁老头', '93岁老头', '94岁老头', '95岁老头', '96岁老头', '97岁老头', '98岁老头', '99岁老头',
    '100岁老头',
    '100多岁老头',
    '1个月女孩',
    # '2个月女孩', '3个月女孩', '4个月女孩', '5个月女孩', '6个月女孩', '7个月女孩', '8个月女孩', '9个月女孩', '10个月女孩', '11个月女孩', '12个月女孩',
    # '1岁女孩', '2岁女孩', '3岁女孩', '4岁女孩', '5岁女孩', '6岁女孩', '7岁女孩', '8岁女孩', '9岁女孩', '10岁女孩',
    # '11岁女孩', '12岁女孩', '13岁女孩', '14岁女孩', '15岁女孩', '16岁女孩', '17岁女孩', '18岁女孩', '19岁女孩', '20岁女人',
    # '21岁女人', '22岁女人', '23岁女人', '24岁女人', '25岁女人', '26岁女人', '27岁女人', '28岁女人', '29岁女人', '30岁女人',
    # '31岁女人', '32岁女人', '33岁女人', '34岁女人', '35岁女人', '36岁女人', '37岁女人', '38岁女人', '39岁女人', '40岁女人',
    # '41岁女人', '42岁女人', '43岁女人', '44岁女人', '45岁中年女人', '46岁中年女人', '47岁中年女人', '48岁中年女人', '49岁中年女人', '50岁中年女人',
    # '51岁中年女人', '52岁中年女人', '53岁中年女人', '54岁中年女人', '55岁中年女人', '56岁中年女人', '57岁中年女人', '58岁中年女人', '59岁中年女人', '60岁中年女人',
    # '61岁老太太', '62岁老太太', '63岁老太太', '64岁老太太', '65岁老太太', '66岁老太太', '67岁老太太', '68岁老太太', '69岁老太太', '70岁老太太',
    # '71岁老太太', '72岁老太太', '73岁老太太', '74岁老太太', '75岁老太太', '76岁老太太', '77岁老太太', '78岁老太太', '79岁老太太', '80岁老太太',
    # '81岁老太太', '82岁老太太', '83岁老太太', '84岁老太太', '85岁老太太', '86岁老太太', '87岁老太太', '88岁老太太', '89岁老太太', '90岁老太太',
    # '91岁老太太', '92岁老太太', '93岁老太太', '94岁老太太', '95岁老太太', '96岁老太太', '97岁老太太', '98岁老太太', '99岁老太太', '100岁老太太', '100多岁老太太',

    # '1个月婴儿', '2个月婴儿', '3个月婴儿', '4个月婴儿', '5个月婴儿', '6个月婴儿', '7个月婴儿', '8个月婴儿', '9个月婴儿', '10个月婴儿', '11个月婴儿', '12个月婴儿',
    # '1岁儿童', '2岁儿童', '3岁儿童', '4岁儿童', '5岁儿童', '6岁儿童', '7岁儿童', '8岁儿童', '9岁儿童', '10岁儿童',
    # '11岁少年', '12岁少年', '13岁少年', '14岁少年', '15岁少年', '16岁少年', '17岁少年', '18岁青年', '19岁青年', '20岁青年',
    # '21岁青年', '22岁青年', '23岁青年', '24岁青年', '25岁青年', '26岁青年', '27岁青年', '28岁青年', '29岁青年', '30岁青年',
    # '31岁青年', '32岁青年', '33岁青年', '34岁青年', '35岁青年', '36岁青年', '37岁青年', '38岁青年', '39岁青年', '40岁青年',
    # '41岁中年人', '42岁中年人', '43岁中年人', '44岁中年人', '45岁中年人', '46岁中年人', '47岁中年人', '48岁中年人', '49岁中年人', '50岁中年人',
    # '51岁中年人', '52岁中年人', '53岁中年人', '54岁中年人', '55岁中年人', '56岁中年人', '57岁中年人', '58岁中年人', '59岁中年人', '60岁中年人',
    # '61岁老人', '62岁老人', '63岁老人', '64岁老人', '65岁老人', '66岁老人','67岁老人', '68岁老人', '69岁老人', '70岁老人',
    # '71岁老人', '72岁老人', '73岁老人', '74岁老人', '75岁老人', '76岁老人', '77岁老人',
    # '78岁老人', '79岁老人', '80岁老人',
    # '81岁老人', '82岁老人', '83岁老人', '84岁老人', '85岁老人', '86岁老人', '87岁老人', '88岁老人', '89岁老人', '90岁老人',
    # '91岁老人', '92岁老人', '93岁老人', '94岁老人', '95岁老人', '96岁老人', '97岁老人', '98岁老人', '99岁老人',
    # '100岁老人',
    # '100多岁'
]

step = 60
settings = json.load(open("./local_settings.json"))
path = str(settings["path"]) + "/baidu"
# 保存图片路径
img_path = path + "/img"
# 保存爬取图片的信息路径
txt_path = path + "/log"

for i in range(0, len(keywords_list)):  # 1):
    # 获取关键字
    keywords = keywords_list[i]
    keywordss = keywords.decode('utf-8').encode('gb2312')
    print keywordss
    # 图像保存地址imgnewpath
    imgnewpath = os.path.join(img_path, keywordss)
    if not os.path.isdir(imgnewpath):
        os.makedirs(imgnewpath)
        # 信息保存地址txtnewpath
    txtnewpath = os.path.join(txt_path, keywordss)
    if not os.path.isdir(txtnewpath):
        os.makedirs(txtnewpath)

    for start in range(0, 1000, step):
        print keywordss, 'start from ', str(start), ' to ', str(start + step - 1)
        html = getHtml(keywords, start)  # 获取源代码
        savename = txtnewpath + '/' + str(start) + '.txt'
        print savename
        Info = open(savename, 'w')
        print getImg(html, start, imgnewpath, Info)  # 获取图像
        Info.close()
